# Homebrew Bundle Configuration
# Target: macOS Environment Initialization
# Fonts are now integrated into the default cask tap.

# Core Development Tools
brew "git"
brew "gh"
brew "zsh"
brew "curl"
brew "node"

# Applications (Casks) - Core
cask "google-chrome"
cask "iterm2"
cask "rectangle"
cask "iina"
cask "aldente"
cask "obsidian"
cask "bitwarden"
cask "tailscale"
cask "royal-tsx"

# Typography
cask "font-meslo-lg-nerd-font"
